W17/CS131.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-08 Wed 23:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Noel Song" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6087046">1. Week 1</a>
<ul>
<li><a href="#org1523241">1.1. Intro Problem</a></li>
<li><a href="#orgc63bc2e">1.2. Language popularity</a></li>
<li><a href="#org83a8e40">1.3. Course description</a></li>
<li><a href="#orge2899f9">1.4. Reasons to prefer one language to another</a></li>
<li><a href="#org269b2d9">1.5. Syntax</a></li>
</ul>
</li>
<li><a href="#org7b64270">2. Week 2</a>
<ul>
<li><a href="#org1476711">2.1. On Context free language</a>
<ul>
<li><a href="#orga65f0b7">2.1.1. Some intro</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb2dcd7a">3. Week 3</a>
<ul>
<li><a href="#orgf5829ca">3.1. Functional programming</a>
<ul>
<li><a href="#orgc0fe7d3">3.1.1. Clarity:</a></li>
<li><a href="#orgdfaf9dc">3.1.2. Performance</a></li>
<li><a href="#org78ce5f0">3.1.3. One success story (empty)</a></li>
<li><a href="#org084e756">3.1.4. Function: What is a function</a></li>
<li><a href="#orge0af987">3.1.5. Higher Order Function (Functional forms in math)</a></li>
<li><a href="#orgca32869">3.1.6. Ocaml</a></li>
<li><a href="#org10fc3d0">3.1.7. Functions</a></li>
</ul>
</li>
<li><a href="#orgc1a567a">3.2. Reading</a></li>
<li><a href="#org6d17e56">3.3. HW</a>
<ul>
<li><a href="#orgc7528b3">3.3.1. Theory</a></li>
<li><a href="#orgfb1330c">3.3.2. Parsing a CFG</a></li>
</ul>
</li>
<li><a href="#org65d62f5">3.4. Translation into machine code</a></li>
</ul>
</li>
<li><a href="#org40dd304">4. Week 4</a>
<ul>
<li><a href="#orga385a38">4.1. Compiler vs. Intepreter</a></li>
<li><a href="#orgd4539d8">4.2. Hybrid Approach: JVM</a>
<ul>
<li><a href="#orgbe48a88">4.2.1. Profiling</a></li>
</ul>
</li>
<li><a href="#orgf2da2b1">4.3. Linking</a></li>
<li><a href="#org78d7f5c">4.4. Type</a>
<ul>
<li><a href="#org6a7ddcb">4.4.1. Type equivalence: Structurally Equivalence and Name equivalence</a></li>
<li><a href="#orgfd48bed">4.4.2. Subtype</a></li>
</ul>
</li>
<li><a href="#orgf86a491">4.5. Polymorphism</a></li>
<li><a href="#orgfc9daa9">4.6. Java &#x2013; history</a></li>
<li><a href="#orgf2e178a">4.7. Java Types</a></li>
<li><a href="#org675c947">4.8. Java: Single Inheritance</a></li>
</ul>
</li>
<li><a href="#org51ac626">5. Week 5</a>
<ul>
<li><a href="#orgf431575">5.1. Abstract Class</a>
<ul>
<li><a href="#org277bce8">5.1.1. Java Standard Library</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6087046" class="outline-2">
<h2 id="org6087046"><span class="section-number-2">1</span> Week 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org1523241" class="outline-3">
<h3 id="org1523241"><span class="section-number-3">1.1</span> Intro Problem</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Given a text file as input. Generate a list of words sorted according to its
frequency in the input file.
</p>

<ul class="org-ul">
<li>Literate Programming</li>

<li><p>
Professor simple method
</p>
<div class="org-src-container">
<pre class="src src-shell">tr -cs a-zA-Z [\n]  |  sort  | uniq  -c  | sort -nr
</pre>
</div></li>

<li>Parallelism on the Above Method
In a four core matchine it is possible for true parallelism. However, sort
can only output after finishing processing all its input.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc63bc2e" class="outline-3">
<h3 id="orgc63bc2e"><span class="section-number-3">1.2</span> Language popularity</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Java</li>
<li>C</li>
<li>C++</li>
<li>C#</li>
<li>Python</li>
<li>VBNET</li>
<li>js</li>
<li>Perl</li>
<li>assm</li>
<li>PHP</li>
</ol>
</div>
</div>

<div id="outline-container-org83a8e40" class="outline-3">
<h3 id="org83a8e40"><span class="section-number-3">1.3</span> Course description</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Core of this course
<ul class="org-ul">
<li>Principles and <b>limitations</b> of programming models.</li>

<li>Notations for these models
How to design, use and support for.</li>

<li>Methods to evaluate the strength and weakness of these notations in
various contexts.</li>
</ul></li>

<li>Current reading assignment: Ch 1-3, 5,7,9</li>

<li>Grading:
<ul class="org-ul">
<li>40% final exam; open book + notes; closed computer</li>

<li>20% midterm:</li>

<li>40% HW: 6 - each 5%; 1 - 10%</li>

<li>Late penalty: same as 35L; due on 23:55 on the due date</li>
</ul></li>

<li>Topics
<ul class="org-ul">
<li>Theory behind programming languages</li>

<li>Language design</li>

<li>Syntax</li>

<li>Semantics</li>

<li>Functions</li>

<li>Names</li>

<li>Types: descriptions of values</li>

<li>Control: Art of letting your program use CPU</li>

<li>Objects</li>

<li>Exceptions: Sort of control</li>

<li>Concurrency</li>

<li>Scripting: like shell, python</li>

<li>Exercises on Ocaml, Prolong, Java, Python</li>
</ul></li>

<li>Some questions
<ol class="org-ol">
<li>Why are there so many programming languages?
Why cna't we just have one? There is a paper about "NExt 700 programming
language".
Why not only a broad-spectrum approach?</li>

<li>Why software is so slow? (in lisp)
Try C++ instead for fast memory access but loss reliability somehow.</li>
</ol></li>
</ul>
</div>
</div>
