W17/CS131.tex
% Created 2017-02-08 Wed 23:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Noel Song}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Noel Song},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.2)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Week 1}
\label{sec:orgf630056}
\subsection{Intro Problem}
\label{sec:orga78d26b}
Given a text file as input. Generate a list of words sorted according to its
frequency in the input file.

\begin{itemize}
\item Literate Programming

\item Professor simple method
\begin{verbatim}
tr -cs a-zA-Z [\n]  |  sort  | uniq  -c  | sort -nr
\end{verbatim}

\item Parallelism on the Above Method
In a four core matchine it is possible for true parallelism. However, sort
can only output after finishing processing all its input.
\end{itemize}
\subsection{Language popularity}
\label{sec:orgbc87239}
\begin{enumerate}
\item Java
\item C
\item C++
\item C\#
\item Python
\item VBNET
\item js
\item Perl
\item assm
\item PHP
\end{enumerate}

\subsection{Course description}
\label{sec:org2cae0e3}
\begin{itemize}
\item Core of this course
\begin{itemize}
\item Principles and \textbf{limitations} of programming models.

\item Notations for these models
How to design, use and support for.

\item Methods to evaluate the strength and weakness of these notations in
various contexts.
\end{itemize}

\item Current reading assignment: Ch 1-3, 5,7,9

\item Grading:
\begin{itemize}
\item 40\% final exam; open book + notes; closed computer

\item 20\% midterm:

\item 40\% HW: 6 - each 5\%; 1 - 10\%

\item Late penalty: same as 35L; due on 23:55 on the due date
\end{itemize}

\item Topics
\begin{itemize}
\item Theory behind programming languages

\item Language design

\item Syntax

\item Semantics

\item Functions

\item Names

\item Types: descriptions of values

\item Control: Art of letting your program use CPU

\item Objects

\item Exceptions: Sort of control

\item Concurrency

\item Scripting: like shell, python

\item Exercises on Ocaml, Prolong, Java, Python
\end{itemize}

\item Some questions
\begin{enumerate}
\item Why are there so many programming languages?
Why cna't we just have one? There is a paper about "NExt 700 programming
language".
Why not only a broad-spectrum approach?

\item Why software is so slow? (in lisp)
Try C++ instead for fast memory access but loss reliability somehow.
\end{enumerate}
\end{itemize}
