W17/CS131.html

<div id="outline-container-orge2899f9" class="outline-3">
<h3 id="orge2899f9"><span class="section-number-3">1.4</span> Reasons to prefer one language to another</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Popularity</li>
<li>Support from compilers, debuggers, etc.</li>
<li>Similarity to existing languages</li>
<li>Simplicity</li>
<li>Versatility: How widly can we apply this language</li>
<li>Performance
<ul class="org-ul">
<li>CPU</li>
<li>Memory</li>
<li>IO (disk/flash)</li>
<li>Network</li>
</ul></li>
<li>Scalability: how well the language is for larger and larger program.</li>
<li>Reliability</li>
<li>Convenience: How easy to use? (i++ in C)</li>
</ul>

<p>
We have competing goals, like similarity is in contradiction with convenience.
</p>

<ul class="org-ul">
<li><p>
Orthoganality
From mathematic concept, there are independent axis which means change in one
axis does not impose changes on another axis. Once we have multiple features,
people do not need to worry about some other features.
</p>

<p>
Example: In C, a function can return any kind of types
</p>
<div class="org-src-container">
<pre class="src src-C">int f();
char g();
struct s h();
</pre>
</div>
<p>
However, we cannot return an array (or a function). One argument is that copy
is potentially expensive.
Then what about a structure? We can have a structure that is really big and
that works. 
They want to emphasize that arr and pointer are the same thing.
</p>

<p>
Consider you want to write a code return some type t defined
elsewhere. However, that is not guaranteed feasible (what if that t is an
array type or function type?). Therefore, C kind of lack of orthoganality.
</p></li>

<li>Safety(Important subset of reliability)
Does not cause really bad consequence.</li>

<li>Concurrency for multi-threaded program</li>
<li>Exceptions handling</li>
<li>Mutability (Successful language evolve)\</li>
</ul>
<p>
We want language that can change over time.
</p>

<p>
Example: A language on 1971 run on PDP-11
two int add
16 KB RAM
1.2 us memory
</p>

<p>
Anyway, on this machine, memory access if considerably faster than
cpu. Therefore, a language tuned for this machine has easy access to memory. 
</p>

<p>
Nowadays, cpu speed is 100x faster than memory access.
</p>

<p>
Example: Varying number of args for function.
  In C there is some called Obj.
  Obj arr[7];
  arr[4] = &#x2026;
  arr[1] = &#x2026;
  Foo(7, arr); 
  What we really want: foo(x, yz, w, u, v) but we have to fill those variables
  in array. 
</p>

<p>
We cannot realize this exactly but we can approach this as much as we can.
</p>
<div class="org-src-container">
<pre class="src src-c">#define ELTS(a) sizeof(a)/sizeof(*(a))
#define CALLMANY(f, args) (f)(ELTS(args), args)

#define CALLN(f, ...)  CALLMANY(f, (Obj[]{__VA_ARGS__}))

Obj args[7];
// Some Assignemtns
//CALLMANY(Foo, args);
CALLN(Foo, x, y,z ,u, v, a, b ,c);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c">#define IF if(
#define THEN ){
#define ELSE } else {
#define FI }
</pre>
</div>

<p>
These are examples of mutability. Can the program evolve with the changing
hardware (outside world). Can it change according to the idea of the
programmer.
</p>
</div>
</div>

<div id="outline-container-org269b2d9" class="outline-3">
<h3 id="org269b2d9"><span class="section-number-3">1.5</span> Syntax</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><p>
whether a program is valid????
</p>
<div class="org-src-container">
<pre class="src src-c">int x = "abc"; // No syntax rule indicates that this is invalid
int main(void) {return ""[1]; } // Stil, no syntax rule indicates that this is not valid.
</pre>
</div>
<p>
Above programs are definitely wrong but not because of wrong syntax.
</p></li>

<li>whether a program will compile????
Consider the first example. It will not compile not because its syntax.</li>

<li><b>A syntax is the form independent of meanings</b>
In syntax we just care about its form. We do not care about what does it mean.</li>

<li>Syntax
"Clolorless greed ideas sleep furiously." ===&gt; Good syntax, nonsensee
semantics.</li>

<li><p>
Natural Language Syntax
"Ireland has leoperd galore. "&#x2013;P.Egger  ===&gt; Bad syntax but meaning is
clear
</p>

<p>
In real life the meaning is important. However, in the world of
programming, syntax is critical.
</p>

<p>
"Time flies." 'Time' chould be none and verb, so does 'files'. This is the
problem of ambiguity.
</p></li>

<li>Programming language syntax: Reasons to prefer one over another
<ul class="org-ul">
<li>Inertia: Use syntax people have already get used to.
a + b OR a b +</li>

<li><p>
simple and regular
Pick syntax that lets us say things easily.
Some claim postfix notation is simpler and regular.
In C, (a+b)*c. With postfix, a b + c * ==&gt; No parens.
</p>

<p>
The first reason prefers normal syntax
</p></li>

<li><p>
It's unambiguous
</p>
<div class="org-src-container">
<pre class="src src-c">a---b;
// a-----b; does not work
a--- --b;
</pre>
</div>
<p>
Why a&#x2013;&#x2014;b does not work?
Because the token analyzer (tokenizer) reads from left to right and it reads
greedily. The above line of code is intepreted as (a)(&#x2013;)(&#x2013;)(-)(b).
<b>Greedy means it is going to keep gluing characters together</b>
</p></li>
</ul></li>
</ul>
<ul class="org-ul">
<li>Tokenization
comment: ??</li>

<li>Language without keyword: no reserved word
Why we have language like this? ==&gt; mutability? backward compatibility?
Note that for C/C++ it is painful to improve the language.</li>
</ul>

<p>
Clear syntax is one where visualization skill "work"
Example
do {
   x/=10;
} while(x &gt; 10);
</p>

<p>
do {
  x/=10
} until(x &lt;= 10)
</p>

<p>
if( i &gt; 0 &amp;&amp; i &lt; 1000) // Not what we want
if(0 &lt; i &amp;&amp; i &lt; 1000)
</p>
</div>
</div>
</div>
