W17/CS131.tex

\subsection{Reasons to prefer one language to another}
\label{sec:org5d833c0}
\begin{itemize}
\item Popularity
\item Support from compilers, debuggers, etc.
\item Similarity to existing languages
\item Simplicity
\item Versatility: How widly can we apply this language
\item Performance
\begin{itemize}
\item CPU
\item Memory
\item IO (disk/flash)
\item Network
\end{itemize}
\item Scalability: how well the language is for larger and larger program.
\item Reliability
\item Convenience: How easy to use? (i++ in C)
\end{itemize}

We have competing goals, like similarity is in contradiction with convenience.

\begin{itemize}
\item Orthoganality
From mathematic concept, there are independent axis which means change in one
axis does not impose changes on another axis. Once we have multiple features,
people do not need to worry about some other features.

Example: In C, a function can return any kind of types
\begin{verbatim}
int f();
char g();
struct s h();
\end{verbatim}
However, we cannot return an array (or a function). One argument is that copy
is potentially expensive.
Then what about a structure? We can have a structure that is really big and
that works. 
They want to emphasize that arr and pointer are the same thing.

Consider you want to write a code return some type t defined
elsewhere. However, that is not guaranteed feasible (what if that t is an
array type or function type?). Therefore, C kind of lack of orthoganality.

\item Safety(Important subset of reliability)
Does not cause really bad consequence.

\item Concurrency for multi-threaded program
\item Exceptions handling
\item Mutability (Successful language evolve)$\backslash$
\end{itemize}
We want language that can change over time.

Example: A language on 1971 run on PDP-11
two int add
16 KB RAM
1.2 us memory

Anyway, on this machine, memory access if considerably faster than
cpu. Therefore, a language tuned for this machine has easy access to memory. 

Nowadays, cpu speed is 100x faster than memory access.

Example: Varying number of args for function.
  In C there is some called Obj.
  Obj arr[7];
  arr[4] = \ldots{}
  arr[1] = \ldots{}
  Foo(7, arr); 
  What we really want: foo(x, yz, w, u, v) but we have to fill those variables
  in array. 

We cannot realize this exactly but we can approach this as much as we can.
\begin{verbatim}
#define ELTS(a) sizeof(a)/sizeof(*(a))
#define CALLMANY(f, args) (f)(ELTS(args), args)

#define CALLN(f, ...)  CALLMANY(f, (Obj[]{__VA_ARGS__}))

Obj args[7];
// Some Assignemtns
//CALLMANY(Foo, args);
CALLN(Foo, x, y,z ,u, v, a, b ,c);
\end{verbatim}

\begin{verbatim}
#define IF if(
#define THEN ){
#define ELSE } else {
#define FI }
\end{verbatim}

These are examples of mutability. Can the program evolve with the changing
hardware (outside world). Can it change according to the idea of the
programmer.

\subsection{Syntax}
\label{sec:orga024d6d}
\begin{itemize}
\item whether a program is valid????
\begin{verbatim}
int x = "abc"; // No syntax rule indicates that this is invalid
int main(void) {return ""[1]; } // Stil, no syntax rule indicates that this is not valid.
\end{verbatim}
Above programs are definitely wrong but not because of wrong syntax.

\item whether a program will compile????
Consider the first example. It will not compile not because its syntax.

\item \textbf{A syntax is the form independent of meanings}
In syntax we just care about its form. We do not care about what does it mean.

\item Syntax
"Clolorless greed ideas sleep furiously." ===> Good syntax, nonsensee
semantics.

\item Natural Language Syntax
"Ireland has leoperd galore. "--P.Egger  ===> Bad syntax but meaning is
clear

In real life the meaning is important. However, in the world of
programming, syntax is critical.

"Time flies." 'Time' chould be none and verb, so does 'files'. This is the
problem of ambiguity.

\item Programming language syntax: Reasons to prefer one over another
\begin{itemize}
\item Inertia: Use syntax people have already get used to.
a + b OR a b +

\item simple and regular
Pick syntax that lets us say things easily.
Some claim postfix notation is simpler and regular.
In C, (a+b)*c. With postfix, a b + c * ==> No parens.

The first reason prefers normal syntax

\item It's unambiguous
\begin{verbatim}
a---b;
// a-----b; does not work
a--- --b;
\end{verbatim}
Why a-----b does not work?
Because the token analyzer (tokenizer) reads from left to right and it reads
greedily. The above line of code is intepreted as (a)(--)(--)(-)(b).
\textbf{Greedy means it is going to keep gluing characters together}
\end{itemize}
\end{itemize}
\begin{itemize}
\item Tokenization
comment: ??

\item Language without keyword: no reserved word
Why we have language like this? ==> mutability? backward compatibility?
Note that for C/C++ it is painful to improve the language.
\end{itemize}

Clear syntax is one where visualization skill "work"
Example
do \{
   x/=10;
\} while(x > 10);

do \{
  x/=10
\} until(x <= 10)

if( i > 0 \&\& i < 1000) // Not what we want
if(0 < i \&\& i < 1000)
