W17/CS131.html
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-orga65f0b7" class="outline-4">
<h4 id="orga65f0b7"><span class="section-number-4">2.1.1</span> Some intro</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Sentence= finite sequence of tokens(terminal symbols)</li>

<li>Token is from a set of finite elements.
<ul class="org-ul">
<li>Identifier: A special kind of token.</li>
<li>Some tokens have special information associated which is important for the
language's semantics.</li>
<li>A sentence must be finite</li>
<li><p>
Set of tokens must be finite: Important for analyzing of the language.
</p>

<p>
Example: L = {a<sup>nb</sup><sup>n</sup> | n &gt;= 0}
	 This language has infinite token set.
	 This language does not scale well.
</p></li>
</ul></li>

<li>Nonterminal
Short for a (finite) sequence of tokens, than can be part of a sentence.</li>

<li>Grammar
<ul class="org-ul">
<li>set of tokens(terminal symbols) and a finite set of nonterminal symbols.</li>

<li>Start symbol: a nonterminal symbols</li>

<li><p>
finite set of rules
</p>

<p>
Example: &lt;nonterminal&gt; -&gt; finite sequence of symbols (either a terminal or
nonterminal)
</p></li>

<li>The compiler is going to figure out whether a sentence is a valid program language.</li>

<li><p>
Recursive grammar: A symbol is both on the RHS and LHS
</p>

<p>
Example: Internet RFS 5322 (request for comment)
comtains a grammar for email headers.
</p>
<ul class="org-ul">
<li><p>
Subject: &lt;any sequence of chars, except newline&gt;
Grammar of subject content:
      subject contents -&gt; empty
      subject contents -&gt; subject<sub>contents</sub> CHAR
      (subject content -&gt; CHAR subject<sub>contents</sub>)
</p>

<p>
Different grammar can produce the same sentence.
</p></li>

<li>MessageID: &lt;xxx.xxx@xx.xx.xx&gt;
Grammar of MessageID:
msg-id = "&lt;" word *&lt;"."word&gt; "@" atom * ("." atom) "&gt;"

<ul class="org-ul">
<li>Some meta-notation like "*" (not strict BNF but EBNF)
EBNF just give us some convenience
BNF &lt;==&gt; EBNF
dotword -&gt; &lt;empty&gt; | . word dotword vs. *&lt;"."word&gt;
BNF is better for parser</li>
</ul></li>

<li>Some other grammar
atom = 1 * &lt;any CHAR except special , SPACE and CR&gt;  
specials = ()&lt;&gt;@  
word = atom | quotestring
CTLS = \000 \037 \177
quotestring = &lt;"&gt; *(qtext | quoted-pair) &lt;"&gt;
qtext = &lt;any CHAR except " \ newline&gt;
quoted-pair = "\" CHAR</li>

<li>Possible trouble
<ul class="org-ul">
<li>Infinite long string
Fixed by standard other than grammar</li>

<li>Control symbol in message</li>
</ul></li>

<li><p>
Use RegExpr: Turn a specification of a language to a program
qp = '\\.'
qt = '[^\"]'
ps =
</p>

<p>
Regular expression can be used to write grammar with meta-symbols and terminal symbols.
However, regExpr cannot count.
Note that recursion is not the limitation.
Example: T -&gt; abT is possible (tail-recursion)
	 T -&gt; aTb is not possible to convert (not tail-recursion)
	 (tail-recursion rule)
</p></li>
</ul></li>
</ul></li>

<li>ISO Standard for EBNF: Decreasing in precedence
<ul class="org-ul">
<li>"token" or 'token'</li>
<li>[ option ]</li>
<li>{ repetition }</li>
<li>(* comment *)</li>
<li>X* repetition of X</li>
<li>X-Y: X except for Y</li>
<li>X,Y: concatenation</li>
<li>X | Y: OR</li>
<li>X = expr;</li>
</ul></li>

<li>Define EBNF formmally
syntax = syntax rule, {syntax rule};
syntax rule = meta id, '=', defines list, ';' ;
definitions list = defn, { '|', defns} ;
Note: Define itself through itself</li>

<li>Problems of Grammar
<ul class="org-ul">
<li>Large grammar is hard to understand
<ul class="org-ul">
<li>Syntax chart</li>
</ul></li>
<li>Nonterminal used but not defined (bug in grammar)
Or better described as "non-productive"</li>
<li>Nonterminal are defined but not used
Or better described as "non-reachable"
Cannot reach it from ths start symbol
This applies recursively, consider the following with start symbol A
W -&gt; W A
A -&gt; <i>some other rules</i> | &lt;empty&gt;</li>

<li>Ambiguity
Has multiple way to parse the same input
By making the program easy to parse, you may introduce ambiguity

<ul class="org-ul">
<li><p>
Associativity
E -&gt; E+E
E -&gt; E-E
E -&gt; ID
E -&gt; (E)
</p>

<p>
Has two ways to parse the sentence "a - b - c"
</p>

<ul class="org-ul">
<li><p>
Problem: Is it possible to write a program to test the ambiguity of a
grammar just by looking at the grammar itself?
</p>

<p>
It is too hard. However, we still want to debug the grammar. 比如debug普通
的程序很难，但是我们还是会去debug并且有所收获。Solve the general problem
of ambiguity is hard, but we are looking for a practical partial solution.
</p></li>

<li>General Idea: prohibit the part we do not want. Ambiguous grammar is too</li>
</ul>
<p>
general. Consider the above grammar, is too general. Consider the second
rule, the second E cannot be a plus/minus operation.
</p>

<ul class="org-ul">
<li>Change: result in a more complicated parse tree</li>
</ul>
<p>
E -&gt; T
E -&gt; E+E (This is stil a problem because E is allowed to recurse on both side)
E -&gt; E-T
T -&gt; ID
T -&gt; ( E )
</p>

<ul class="org-ul">
<li>Why we must have (a+b)+c?</li>
<li>Arithmetic overflow: Some order of the operation results in overflow</li>
<li>Floating point rounding problem</li>
<li>Side effects?</li>
<li>Unsigned arithmetic: Wrap around give different answer
(a+b)+c if a and b are unsigned int but c is unsigned long</li>
</ul></li>

<li><p>
Precedence
</p>

<p>
E -&gt; T
E -&gt; E + T
E -&gt; E*T   ==&gt; E -&gt; F * T
	   ==&gt; T -&gt; F
T -&gt; ID    ==&gt; F -&gt; ID
T -&gt; ( E ) ==&gt; F -&gt; ( E )
</p>

<ul class="org-ul">
<li>Infix grammar has trouble of precedence</li>
</ul></li>

<li>Another ambiguity in C
<ul class="org-ul">
<li>stmt: 
;
break;
continue;
expr;
return expr; (no parens)
while (expr) stmt
do stmt while (expr); (we have no parens)

<ul class="org-ul">
<li><p>
Some modification:
do stmt while expr; ==&gt; This is not going to cause trouble)
while expr stmt     ==&gt; This may cause ambiguous because parser
may combine expr and stmt together:
while i&lt;1 *c / while i&lt;1 -c;
</p>

<p>
The parens for expr in do-while is not going to solve ambiguity
but it is still there because we want consistency.
</p></li>
</ul></li>

<li>Some other statement
{ stmt or declaration list }
for(expr; expr; expr;) stmt
if (expr) stmt
if (expr) stmt else stmt
switch (expr) stmt

<ul class="org-ul">
<li>Dangling "else" problem
fix: stmt: if (expr) stmt | stmt1 
stmt1 has everything except if (expr) stmt</li>
</ul></li>
</ul></li>
</ul></li>

<li>Too much details 
<ul class="org-ul">
<li>because of ambiguity
<ul class="org-ul">
<li>Abstract syntax and concrete syntax
Let the parser deal with known ambiguity issue directly instead of writing
complex grammar rule.</li>
</ul></li>
<li><p>
because of attempts to cover too much
IntE -&gt; IntE + IntE | IntE * IntE | IntID| Inte
StrE -&gt; StrID | StrLiteral | StrE ^ StrE
</p>

<p>
Note: The above is rarely done in real world language because there are
infinite number of types. Generally grammar is only good at deal with
syntax but not semantics.
</p></li>
</ul></li>
</ul></li>

<li>Expressions problems

<ul class="org-ul">
<li><p>
user-defined operators (not the c++ way because we must pick the existing
operator and give it new meaning)
</p>

<ul class="org-ul">
<li>Prolong: defining new operator</li>
</ul>
<p>
:-op (700, xfx, [=, &lt;=, &gt;=,])
:-op (500, yfx, [+,-])
:-op (400, yfx, [*, /])
:-op (200, xfy, [**])
:-op (1200, xfy, [&lt;&#x2013;])
</p>

<ul class="org-ul">
<li>500 is the precedence</li>
<li>y means same precedence is ok</li>
<li>x means same precedence is not ok</li>

<li>Note that ambiguity is not possible because "yfy" is not allowed.</li>
</ul></li>

<li><p>
Side effect(especially in C/C++): a = f(x) + g(x);
a = a++ -a++;
We cannot determine the order of executing because compiler will optimize
the code.
</p>

<p>
Example of Professor:
</p>
<div class="org-src-container">
<pre class="src src-c">double stack[1000];
double *top = &amp;sstack[1000];
#define PUSH(x) (*--top = (x))
#define POP()   (*top++)
switch(op) {
 case MULTI:
   PUSH( POP() * POP());
   break;
 }
</pre>
</div>
<p>
*&#x2013;top = (*top++) * (*top++);
</p></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
