W17/CS131.tex
\subsubsection{Some intro}
\label{sec:org6812f68}
\begin{itemize}
\item Sentence= finite sequence of tokens(terminal symbols)

\item Token is from a set of finite elements.
\begin{itemize}
\item Identifier: A special kind of token.
\item Some tokens have special information associated which is important for the
language's semantics.
\item A sentence must be finite
\item Set of tokens must be finite: Important for analyzing of the language.

Example: L = \{a\(^{\text{nb}}\)\(^{\text{n}}\) | n >= 0\}
	 This language has infinite token set.
	 This language does not scale well.
\end{itemize}

\item Nonterminal
Short for a (finite) sequence of tokens, than can be part of a sentence.

\item Grammar
\begin{itemize}
\item set of tokens(terminal symbols) and a finite set of nonterminal symbols.

\item Start symbol: a nonterminal symbols

\item finite set of rules

Example: <nonterminal> -> finite sequence of symbols (either a terminal or
nonterminal)

\item The compiler is going to figure out whether a sentence is a valid program language.

\item Recursive grammar: A symbol is both on the RHS and LHS

Example: Internet RFS 5322 (request for comment)
comtains a grammar for email headers.
\begin{itemize}
\item Subject: <any sequence of chars, except newline>
Grammar of subject content:
      subject contents -> empty
      subject contents -> subject\(_{\text{contents}}\) CHAR
      (subject content -> CHAR subject\(_{\text{contents}}\))

Different grammar can produce the same sentence.

\item MessageID: <xxx.xxx@xx.xx.xx>
Grammar of MessageID:
msg-id = "<" word *<"."word> "@" atom * ("." atom) ">"

\begin{itemize}
\item Some meta-notation like "*" (not strict BNF but EBNF)
EBNF just give us some convenience
BNF <==> EBNF
dotword -> <empty> | . word dotword vs. *<"."word>
BNF is better for parser
\end{itemize}

\item Some other grammar
atom = 1 * <any CHAR except special , SPACE and CR>  
specials = ()<>@  
word = atom | quotestring
CTLS = $\backslash$000 $\backslash$037 $\backslash$177
quotestring = <"> *(qtext | quoted-pair) <">
qtext = <any CHAR except " $\backslash$ newline>
quoted-pair = "$\backslash$" CHAR

\item Possible trouble
\begin{itemize}
\item Infinite long string
Fixed by standard other than grammar

\item Control symbol in message
\end{itemize}

\item Use RegExpr: Turn a specification of a language to a program
qp = '$\backslash$\.'
qt = '[\^{}$\backslash$"]'
ps =

Regular expression can be used to write grammar with meta-symbols and terminal symbols.
However, regExpr cannot count.
Note that recursion is not the limitation.
Example: T -> abT is possible (tail-recursion)
	 T -> aTb is not possible to convert (not tail-recursion)
	 (tail-recursion rule)
\end{itemize}
\end{itemize}

\item ISO Standard for EBNF: Decreasing in precedence
\begin{itemize}
\item "token" or 'token'
\item\relax [ option ]
\item \{ repetition \}
\item (* comment *)
\item X* repetition of X
\item X-Y: X except for Y
\item X,Y: concatenation
\item X | Y: OR
\item X = expr;
\end{itemize}

\item Define EBNF formmally
syntax = syntax rule, \{syntax rule\};
syntax rule = meta id, '=', defines list, ';' ;
definitions list = defn, \{ '|', defns\} ;
Note: Define itself through itself

\item Problems of Grammar
\begin{itemize}
\item Large grammar is hard to understand
\begin{itemize}
\item Syntax chart
\end{itemize}
\item Nonterminal used but not defined (bug in grammar)
Or better described as "non-productive"
\item Nonterminal are defined but not used
Or better described as "non-reachable"
Cannot reach it from ths start symbol
This applies recursively, consider the following with start symbol A
W -> W A
A -> \emph{some other rules} | <empty>

\item Ambiguity
Has multiple way to parse the same input
By making the program easy to parse, you may introduce ambiguity

\begin{itemize}
\item Associativity
E -> E+E
E -> E-E
E -> ID
E -> (E)

Has two ways to parse the sentence "a - b - c"

\begin{itemize}
\item Problem: Is it possible to write a program to test the ambiguity of a
grammar just by looking at the grammar itself?

It is too hard. However, we still want to debug the grammar. 比如debug普通
的程序很难，但是我们还是会去debug并且有所收获。Solve the general problem
of ambiguity is hard, but we are looking for a practical partial solution.

\item General Idea: prohibit the part we do not want. Ambiguous grammar is too
\end{itemize}
general. Consider the above grammar, is too general. Consider the second
rule, the second E cannot be a plus/minus operation.

\begin{itemize}
\item Change: result in a more complicated parse tree
\end{itemize}
E -> T
E -> E+E (This is stil a problem because E is allowed to recurse on both side)
E -> E-T
T -> ID
T -> ( E )

\begin{itemize}
\item Why we must have (a+b)+c?
\item Arithmetic overflow: Some order of the operation results in overflow
\item Floating point rounding problem
\item Side effects?
\item Unsigned arithmetic: Wrap around give different answer
(a+b)+c if a and b are unsigned int but c is unsigned long
\end{itemize}

\item Precedence

E -> T
E -> E + T
E -> E*T   ==> E -> F * T
	   ==> T -> F
T -> ID    ==> F -> ID
T -> ( E ) ==> F -> ( E )

\begin{itemize}
\item Infix grammar has trouble of precedence
\end{itemize}

\item Another ambiguity in C
\begin{itemize}
\item stmt: 
;
break;
continue;
expr;
return expr; (no parens)
while (expr) stmt
do stmt while (expr); (we have no parens)

\begin{itemize}
\item Some modification:
do stmt while expr; ==> This is not going to cause trouble)
while expr stmt     ==> This may cause ambiguous because parser
may combine expr and stmt together:
while i<1 *c / while i<1 -c;

The parens for expr in do-while is not going to solve ambiguity
but it is still there because we want consistency.
\end{itemize}

\item Some other statement
\{ stmt or declaration list \}
for(expr; expr; expr;) stmt
if (expr) stmt
if (expr) stmt else stmt
switch (expr) stmt

\begin{itemize}
\item Dangling "else" problem
fix: stmt: if (expr) stmt | stmt1 
stmt1 has everything except if (expr) stmt
\end{itemize}
\end{itemize}
\end{itemize}

\item Too much details 
\begin{itemize}
\item because of ambiguity
\begin{itemize}
\item Abstract syntax and concrete syntax
Let the parser deal with known ambiguity issue directly instead of writing
complex grammar rule.
\end{itemize}
\item because of attempts to cover too much
IntE -> IntE + IntE | IntE * IntE | IntID| Inte
StrE -> StrID | StrLiteral | StrE \^{} StrE

Note: The above is rarely done in real world language because there are
infinite number of types. Generally grammar is only good at deal with
syntax but not semantics.
\end{itemize}
\end{itemize}

\item Expressions problems

\begin{itemize}
\item user-defined operators (not the c++ way because we must pick the existing
operator and give it new meaning)

\begin{itemize}
\item Prolong: defining new operator
\end{itemize}
:-op (700, xfx, [=, <=, >=,])
:-op (500, yfx, [+,-])
:-op (400, yfx, [*, /])
:-op (200, xfy, [**])
:-op (1200, xfy, [<--])

\begin{itemize}
\item 500 is the precedence
\item y means same precedence is ok
\item x means same precedence is not ok

\item Note that ambiguity is not possible because "yfy" is not allowed.
\end{itemize}

\item Side effect(especially in C/C++): a = f(x) + g(x);
a = a++ -a++;
We cannot determine the order of executing because compiler will optimize
the code.

Example of Professor:
\begin{verbatim}
double stack[1000];
double *top = &sstack[1000];
#define PUSH(x) (*--top = (x))
#define POP()   (*top++)
switch(op) {
 case MULTI:
   PUSH( POP() * POP());
   break;
 }
\end{verbatim}
*--top = (*top++) * (*top++);
\end{itemize}
\end{itemize}
