W17/CS131.html


<div id="outline-container-orgb2dcd7a" class="outline-2">
<h2 id="orgb2dcd7a"><span class="section-number-2">3</span> Week 3</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgf5829ca" class="outline-3">
<h3 id="orgf5829ca"><span class="section-number-3">3.1</span> Functional programming</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Functional programming motivation
<ul class="org-ul">
<li>Clarity</li>
<li>performance</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgc0fe7d3" class="outline-4">
<h4 id="orgc0fe7d3"><span class="section-number-4">3.1.1</span> Clarity:</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Take advantage of mathematic notation
We want to build on mathematic traditions.
<ul class="org-ul">
<li>a + b = b + a
May not true in C due to side effects
(a+=10) + (a-=10)</li>
<li>E - E = 0
what if E is getchar() which return different char each time.</li>
<li>i = i + 1 is definitely false mathematically</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgdfaf9dc" class="outline-4">
<h4 id="orgdfaf9dc"><span class="section-number-4">3.1.2</span> Performance</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
C or Java are designed for Von Neuman architecture(loading and store)
</p>
</div>
</div>

<div id="outline-container-org78ce5f0" class="outline-4">
<h4 id="org78ce5f0"><span class="section-number-4">3.1.3</span> One success story (empty)</h4>
</div>

<div id="outline-container-org084e756" class="outline-4">
<h4 id="org084e756"><span class="section-number-4">3.1.4</span> Function: What is a function</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>CS: a chunk of code with a name
This is how we think when we are implementing the function.</li>

<li>Math: A mapping from a domain to a range
This is how we think when we are using a function.</li>

<li><p>
Side Effect: Evaluation is no longer imposed by sequencing but only by function calls.
</p>
<div class="org-src-container">
<pre class="src src-c">a = f(x);
b = g(y);
c = h(z);
e(a, b, c);
</pre>
</div>
<p>
The above code might have hidden dependency so the sequential relationship
must be as written.
</p>

<div class="org-src-container">
<pre class="src src-c">a = b + f(x) - b;
</pre>
</div>
<p>
In C/C++ or Java, b cannot be eliminated.
</p></li>

<li><p>
Referential transparency: Variables with the same name always have the same
value.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let a = b + (f x) - b
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orge0af987" class="outline-4">
<h4 id="orge0af987"><span class="section-number-4">3.1.5</span> Higher Order Function (Functional forms in math)</h4>
<div class="outline-text-4" id="text-3-1-5">
<ul class="org-ul">
<li>Functions that take function as argument
"Build function on some other functions".
<ul class="org-ul">
<li>Summation operator</li>
<li>Integration operator</li>
<li>Function composition operator "o"</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgca32869" class="outline-4">
<h4 id="orgca32869"><span class="section-number-4">3.1.6</span> Ocaml</h4>
<div class="outline-text-4" id="text-3-1-6">
<ul class="org-ul">
<li>Compile time type checking (like C/C++, Java)
<ul class="org-ul">
<li>Type inference
Do not need to write all types down. The types are inferred from the
context.</li>
</ul></li>

<li>Garbage Collection
No need to worry about storage management.</li>

<li>Good support for higher order function</li>

<li>Name and Types are really important in Ocaml</li>

<li><p>
Pattern matching
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let cons (x,y) = x::y;;
(* The above is equivalent to the following*)
     (fun a -&gt; 
       match a with
       | (x,y) -&gt; x::y)
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org10fc3d0" class="outline-4">
<h4 id="org10fc3d0"><span class="section-number-4">3.1.7</span> Functions</h4>
<div class="outline-text-4" id="text-3-1-7">
<ul class="org-ul">
<li><p>
Simple functions
</p>
<div class="org-src-container">
<pre class="src src-ocaml">(fun a -&gt; a);;
-: 'a -&gt; 'a = &lt;fun&gt;

(fun () -&gt; ());;
-: unit -&gt; unit
</pre>
</div></li>

<li><p>
Higher order function
</p>
<div class="org-src-container">
<pre class="src src-ocaml">(fun x -&gt; match x with
	  | 0 -&gt; (fun x -&gt; -x)
	  | _ -&gt; (fun x -&gt; x * 2));;
-: int -&gt; (int -&gt; int) = &lt;fun&gt;
</pre>
</div>

<ul class="org-ul">
<li>Note that '-&gt;' is right associative</li>
<li>Function is left associative</li>
</ul></li>

<li>Recursion
<ul class="org-ul">
<li><p>
Fib
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec fib n =
match n with
| 0 -&gt; 1
| 1 -&gt; 1
| n -&gt; fib(n-1) + fib(n-2)
</pre>
</div></li>
</ul></li>

<li>Currying function: <b>All the functions are curried</b>
<ul class="org-ul">
<li><p>
Max element in list
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec maxlist =
function 
| (x::l) -&gt; let m = maxlist l in if x &lt; m then m else x
| [] -&gt; 0;;
</pre>
</div></li>

<li><p>
Reverse
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec reverse= function
  | [] -&gt; []
  | (x::l) -&gt; (rev l) @ [x]
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgc1a567a" class="outline-3">
<h3 id="orgc1a567a"><span class="section-number-3">3.2</span> Reading</h3>
<div class="outline-text-3" id="text-3-2">
<p>
1-9, 13, 15, 17
</p>
</div>
</div>
<div id="outline-container-org6d17e56" class="outline-3">
<h3 id="org6d17e56"><span class="section-number-3">3.3</span> HW</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-orgc7528b3" class="outline-4">
<h4 id="orgc7528b3"><span class="section-number-4">3.3.1</span> Theory</h4>
<div class="outline-text-4" id="text-3-3-1">
<ol class="org-ol">
<li>Finite State Automata</li>
<li>Push Down Automata = FSA + Stack</li>
<li>Turing Machine: FSA dealing with infinite term.</li>
</ol>
</div>
</div>
