W17/CS131.tex


\section{Week 3}
\label{sec:org42e3059}
\subsection{Functional programming}
\label{sec:org65cdde2}
\begin{itemize}
\item Functional programming motivation
\begin{itemize}
\item Clarity
\item performance
\end{itemize}
\end{itemize}

\subsubsection{Clarity:}
\label{sec:orgd5c2ac2}
\begin{itemize}
\item Take advantage of mathematic notation
We want to build on mathematic traditions.
\begin{itemize}
\item a + b = b + a
May not true in C due to side effects
(a+=10) + (a-=10)
\item E - E = 0
what if E is getchar() which return different char each time.
\item i = i + 1 is definitely false mathematically
\end{itemize}
\end{itemize}

\subsubsection{Performance}
\label{sec:org18fa146}
C or Java are designed for Von Neuman architecture(loading and store)

\subsubsection{One success story (empty)}
\label{sec:org6484c3a}

\subsubsection{Function: What is a function}
\label{sec:org5aaf39a}
\begin{itemize}
\item CS: a chunk of code with a name
This is how we think when we are implementing the function.

\item Math: A mapping from a domain to a range
This is how we think when we are using a function.

\item Side Effect: Evaluation is no longer imposed by sequencing but only by function calls.
\begin{verbatim}
a = f(x);
b = g(y);
c = h(z);
e(a, b, c);
\end{verbatim}
The above code might have hidden dependency so the sequential relationship
must be as written.

\begin{verbatim}
a = b + f(x) - b;
\end{verbatim}
In C/C++ or Java, b cannot be eliminated.

\item Referential transparency: Variables with the same name always have the same
value.
\begin{verbatim}
let a = b + (f x) - b
\end{verbatim}
\end{itemize}

\subsubsection{Higher Order Function (Functional forms in math)}
\label{sec:org38192ea}
\begin{itemize}
\item Functions that take function as argument
"Build function on some other functions".
\begin{itemize}
\item Summation operator
\item Integration operator
\item Function composition operator "o"
\end{itemize}
\end{itemize}

\subsubsection{Ocaml}
\label{sec:org1519363}
\begin{itemize}
\item Compile time type checking (like C/C++, Java)
\begin{itemize}
\item Type inference
Do not need to write all types down. The types are inferred from the
context.
\end{itemize}

\item Garbage Collection
No need to worry about storage management.

\item Good support for higher order function

\item Name and Types are really important in Ocaml

\item Pattern matching
\begin{verbatim}
let cons (x,y) = x::y;;
(* The above is equivalent to the following*)
     (fun a -> 
       match a with
       | (x,y) -> x::y)
\end{verbatim}
\end{itemize}

\subsubsection{Functions}
\label{sec:orgd7761ad}
\begin{itemize}
\item Simple functions
\begin{verbatim}
(fun a -> a);;
-: 'a -> 'a = <fun>

(fun () -> ());;
-: unit -> unit
\end{verbatim}

\item Higher order function
\begin{verbatim}
(fun x -> match x with
	  | 0 -> (fun x -> -x)
	  | _ -> (fun x -> x * 2));;
-: int -> (int -> int) = <fun>
\end{verbatim}

\begin{itemize}
\item Note that '->' is right associative
\item Function is left associative
\end{itemize}

\item Recursion
\begin{itemize}
\item Fib
\begin{verbatim}
let rec fib n =
match n with
| 0 -> 1
| 1 -> 1
| n -> fib(n-1) + fib(n-2)
\end{verbatim}
\end{itemize}

\item Currying function: \textbf{All the functions are curried}
\begin{itemize}
\item Max element in list
\begin{verbatim}
let rec maxlist =
function 
| (x::l) -> let m = maxlist l in if x < m then m else x
| [] -> 0;;
\end{verbatim}

\item Reverse
\begin{verbatim}
let rec reverse= function
  | [] -> []
  | (x::l) -> (rev l) @ [x]
\end{verbatim}
\end{itemize}
\end{itemize}


\subsection{Reading}
\label{sec:org0067397}
1-9, 13, 15, 17
\subsection{HW}
\label{sec:org40272d1}
\subsubsection{Theory}
\label{sec:orgce00f6e}
\begin{enumerate}
\item Finite State Automata
\item Push Down Automata = FSA + Stack
\item Turing Machine: FSA dealing with infinite term.
\end{enumerate}
