W17/CS131.org
*** Parsing a CFG
    1. Recursion
       Grammar rules are recursive.
    2. Concatenation
       Suppose S -> T U and we know how to build a matcher for T and U
       matcher = acceptor -> token list -> bool

    3. OR (disjunction)
       - lookahead
	 S -> a T b
	 S -> c U d
	 Check if it is a or c

	 However,
	 S -> a T b
	 S -> a U d
	 
	 But we can change it into the following form to use lookahead
	 S -> a S'
	 S' -> T b
	 S' -> U d

	 But if the "T" is "if then"  ???

       - Create a choice point while parsing
	 First parse a T b, if fail then parse a U b
	 BUt need memory to record information

       - Stack
	 Note that function call is build-in stack.

       - acceptor(token list -> bool)
         Takes a string of tokens and indicates correctness
	 #+BEGIN_SRC ocaml
           function | ")"::_ -> true | _ -> false
	 #+END_SRC

** Translation into machine code
   - Consider the following code
     #+BEGIN_SRC c
       int main()
       {
         return ! getchar();
       }
     #+END_SRC
     This piece of code will not compile because getchar() has not been
     declared. We need to include stdio.h

     #+BEGIN_SRC c
       #include <stdio.h>
       int mainn() { return !getchar();}
     #+END_SRC
     
   - Translation
     * Preprocessor: a kind of text expansion.
       #+BEGIN_SRC c
         extern int getchar(void);

         int main() {return !getchar();}
       #+END_SRC

     * Convert program text into sequence of tokens
       Each token is represented by a byte.

       *lexing*: extra information associated with the token. For example, the
       difference between "main" and any other identifier.

     * Parsing: Parse tree
     * Semantics analysis
       - Type checking
       - Scope checking
     * Intermediate code generation
       main:
            push &getchar
            push 0
            call 
            not
            ret
     * Code generation x86_64
       main:
            call getchar
	    tstl %eax, %eax
	    setn %eax, %eax
	    ret 

   - Unix design philosophy (software tools)
     Break a procoess into multiple independent pieces.
     Ensures independence but increase overhead.

   - Smalltallc Design Philosophy (IDE)
     

* Week 4

** Compiler vs. Intepreter


** Hybrid Approach: JVM

Foo.java -> java compiler -> Foo.class(bytecodes)
                              ||
			      \/
			      Java(intepret + profiler(for performance))
			      hotpot -> (another compiler) -> machine code
			      (this method is expensive so we only do it for "hotspot")

*** Profiling
- statistical: sample hw ip 100 times/s => make a histogram
      We can know the "hotspot" of our program

- Insert counting code (gcc -pg -fprofile -...)
      finer graine performance measrue

- Once we know the "hotspot" we translate it into machine code

- Cause nondeterministic performance

- Hard to debug on the lower level compiler
  * Nondeterministic
  * Generally we will never see the machine code??


** Linking

- Loading time dynamic linking (load code before main start)
  Library will be dynamically linked as part of initialization process.

- Running dynamic linking (use special function to call)
  Self modifying code
  * Pros: Flexibility
  * Cons: Library version conflict: some module need version 1 but some other need version 2
  * Cons: Worry about unstructed code
    Once we allow dynamic linking, our program may execute some suspicious code.

