W17/CS131.html

<div id="outline-container-orgfb1330c" class="outline-4">
<h4 id="orgfb1330c"><span class="section-number-4">3.3.2</span> Parsing a CFG</h4>
<div class="outline-text-4" id="text-3-3-2">
<ol class="org-ol">
<li>Recursion
Grammar rules are recursive.</li>
<li>Concatenation
Suppose S -&gt; T U and we know how to build a matcher for T and U
matcher = acceptor -&gt; token list -&gt; bool</li>

<li>OR (disjunction)
<ul class="org-ul">
<li><p>
lookahead
S -&gt; a T b
S -&gt; c U d
Check if it is a or c
</p>

<p>
However,
S -&gt; a T b
S -&gt; a U d
</p>

<p>
But we can change it into the following form to use lookahead
S -&gt; a S'
S' -&gt; T b
S' -&gt; U d
</p>

<p>
But if the "T" is "if then"  ???
</p></li>

<li>Create a choice point while parsing
First parse a T b, if fail then parse a U b
BUt need memory to record information</li>

<li>Stack
Note that function call is build-in stack.</li>

<li><p>
acceptor(token list -&gt; bool)
Takes a string of tokens and indicates correctness
</p>
<div class="org-src-container">
<pre class="src src-ocaml">function | ")"::_ -&gt; true | _ -&gt; false
</pre>
</div></li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org65d62f5" class="outline-3">
<h3 id="org65d62f5"><span class="section-number-3">3.4</span> Translation into machine code</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><p>
Consider the following code
</p>
<div class="org-src-container">
<pre class="src src-c">int main()
{
  return ! getchar();
}
</pre>
</div>
<p>
This piece of code will not compile because getchar() has not been
declared. We need to include stdio.h
</p>

<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
int mainn() { return !getchar();}
</pre>
</div></li>

<li>Translation
<ul class="org-ul">
<li><p>
Preprocessor: a kind of text expansion.
</p>
<div class="org-src-container">
<pre class="src src-c">extern int getchar(void);

int main() {return !getchar();}
</pre>
</div></li>

<li><p>
Convert program text into sequence of tokens
Each token is represented by a byte.
</p>

<p>
<b>lexing</b>: extra information associated with the token. For example, the
difference between "main" and any other identifier.
</p></li>

<li>Parsing: Parse tree</li>
<li>Semantics analysis
<ul class="org-ul">
<li>Type checking</li>
<li>Scope checking</li>
</ul></li>
<li>Intermediate code generation
main:
     push &amp;getchar
     push 0
     call 
     not
     ret</li>
<li>Code generation x86<sub>64</sub>
main:
     call getchar
     tstl %eax, %eax
     setn %eax, %eax
     ret</li>
</ul></li>

<li>Unix design philosophy (software tools)
Break a procoess into multiple independent pieces.
Ensures independence but increase overhead.</li>

<li>Smalltallc Design Philosophy (IDE)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org40dd304" class="outline-2">
<h2 id="org40dd304"><span class="section-number-2">4</span> Week 4</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orga385a38" class="outline-3">
<h3 id="orga385a38"><span class="section-number-3">4.1</span> Compiler vs. Intepreter</h3>
</div>


<div id="outline-container-orgd4539d8" class="outline-3">
<h3 id="orgd4539d8"><span class="section-number-3">4.2</span> Hybrid Approach: JVM</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Foo.java -&gt; java compiler -&gt; Foo.class(bytecodes)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
\/
Java(intepret + profiler(for performance))
hotpot -&gt; (another compiler) -&gt; machine code
(this method is expensive so we only do it for "hotspot")
</p>
</div>

<div id="outline-container-orgbe48a88" class="outline-4">
<h4 id="orgbe48a88"><span class="section-number-4">4.2.1</span> Profiling</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li>statistical: sample hw ip 100 times/s =&gt; make a histogram
We can know the "hotspot" of our program</li>

<li>Insert counting code (gcc -pg -fprofile -&#x2026;)
finer graine performance measrue</li>

<li>Once we know the "hotspot" we translate it into machine code</li>

<li>Cause nondeterministic performance</li>

<li>Hard to debug on the lower level compiler
<ul class="org-ul">
<li>Nondeterministic</li>
<li>Generally we will never see the machine code??</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgf2da2b1" class="outline-3">
<h3 id="orgf2da2b1"><span class="section-number-3">4.3</span> Linking</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Loading time dynamic linking (load code before main start)
Library will be dynamically linked as part of initialization process.</li>

<li>Running dynamic linking (use special function to call)
Self modifying code
<ul class="org-ul">
<li>Pros: Flexibility</li>
<li>Cons: Library version conflict: some module need version 1 but some other need version 2</li>
<li>Cons: Worry about unstructed code
Once we allow dynamic linking, our program may execute some suspicious code.</li>
</ul></li>
</ul>
</div>
</div>
