W17/CS131.tex

\subsubsection{Parsing a CFG}
\label{sec:org985bd24}
\begin{enumerate}
\item Recursion
Grammar rules are recursive.
\item Concatenation
Suppose S -> T U and we know how to build a matcher for T and U
matcher = acceptor -> token list -> bool

\item OR (disjunction)
\begin{itemize}
\item lookahead
S -> a T b
S -> c U d
Check if it is a or c

However,
S -> a T b
S -> a U d

But we can change it into the following form to use lookahead
S -> a S'
S' -> T b
S' -> U d

But if the "T" is "if then"  ???

\item Create a choice point while parsing
First parse a T b, if fail then parse a U b
BUt need memory to record information

\item Stack
Note that function call is build-in stack.

\item acceptor(token list -> bool)
Takes a string of tokens and indicates correctness
\begin{verbatim}
function | ")"::_ -> true | _ -> false
\end{verbatim}
\end{itemize}
\end{enumerate}

\subsection{Translation into machine code}
\label{sec:org6a4769d}
\begin{itemize}
\item Consider the following code
\begin{verbatim}
int main()
{
  return ! getchar();
}
\end{verbatim}
This piece of code will not compile because getchar() has not been
declared. We need to include stdio.h

\begin{verbatim}
#include <stdio.h>
int mainn() { return !getchar();}
\end{verbatim}

\item Translation
\begin{itemize}
\item Preprocessor: a kind of text expansion.
\begin{verbatim}
extern int getchar(void);

int main() {return !getchar();}
\end{verbatim}

\item Convert program text into sequence of tokens
Each token is represented by a byte.

\textbf{lexing}: extra information associated with the token. For example, the
difference between "main" and any other identifier.

\item Parsing: Parse tree
\item Semantics analysis
\begin{itemize}
\item Type checking
\item Scope checking
\end{itemize}
\item Intermediate code generation
main:
     push \&getchar
     push 0
     call 
     not
     ret
\item Code generation x86\(_{\text{64}}\)
main:
     call getchar
     tstl \%eax, \%eax
     setn \%eax, \%eax
     ret
\end{itemize}

\item Unix design philosophy (software tools)
Break a procoess into multiple independent pieces.
Ensures independence but increase overhead.

\item Smalltallc Design Philosophy (IDE)
\end{itemize}


\section{Week 4}
\label{sec:org87a8f35}

\subsection{Compiler vs. Intepreter}
\label{sec:orgc70d434}


\subsection{Hybrid Approach: JVM}
\label{sec:org0ccf83b}

Foo.java -> java compiler -> Foo.class(bytecodes)
\begin{center}
\begin{tabular}{l}
\\
\end{tabular}
\end{center}
$\backslash$/
Java(intepret + profiler(for performance))
hotpot -> (another compiler) -> machine code
(this method is expensive so we only do it for "hotspot")

\subsubsection{Profiling}
\label{sec:orgc5ee857}
\begin{itemize}
\item statistical: sample hw ip 100 times/s => make a histogram
We can know the "hotspot" of our program

\item Insert counting code (gcc -pg -fprofile -\ldots{})
finer graine performance measrue

\item Once we know the "hotspot" we translate it into machine code

\item Cause nondeterministic performance

\item Hard to debug on the lower level compiler
\begin{itemize}
\item Nondeterministic
\item Generally we will never see the machine code??
\end{itemize}
\end{itemize}


\subsection{Linking}
\label{sec:org30332c0}

\begin{itemize}
\item Loading time dynamic linking (load code before main start)
Library will be dynamically linked as part of initialization process.

\item Running dynamic linking (use special function to call)
Self modifying code
\begin{itemize}
\item Pros: Flexibility
\item Cons: Library version conflict: some module need version 1 but some other need version 2
\item Cons: Worry about unstructed code
Once we allow dynamic linking, our program may execute some suspicious code.
\end{itemize}
\end{itemize}
