W17/CS131.org
** Type
- Why we need type
  * Help us understand the code
    when we look at an id x, we know which operations are valid and which are
    not.  
  * Reliability/Redundancy
    #+BEGIN_SRC c
    string x;
    x = x + 1; // ???
    #+END_SRC
    Catch trivial mistakes early
  * Performance
    Type helps compiler generate better code

- Strongly Typed: All operations are type checked, you cannot escape
  C/C++ is not strongly typed.

- Primitive vs. Constructed types
  * Primitive types are built in while structure type are built by user.
  * array of C/C++ are constructed types

- What is type? Is it some data structure? How exposed is the implementation of
  a type?
  * Exposed Type
    User know details of the type: integral type

  * Abstract Type
    User only konw what operation can be done to that type
    check NaN
    #+BEGIN_SRC c
    bool isnanf(float x)
    { return x!=x; }
    bool isinfinityf()
    { return x!=0 && x == 2*x; }
    #+END_SRC
    
    - floating point
      * Abstract type 
      * Why we need small number?
	We need computation with small number
	#+BEGIN_SRC c
	if(x == y && x-y==0) // does this always true????
	#+END_SRC
	
*** Type equivalence: Structurally Equivalence and Name equivalence
    - C uses structural equivalence for typedef and name equivalence for struct
      type.

*** Subtype
    #+BEGIN_SRC pascal
    var a int,
    var b 1..127,
    #+END_SRC
    - Subtype in C
      * float and double
      * char* vs. char const* ???
	#+BEGIN_SRC c
	char *p;
	char const* c_p;
	c_p = p;
	// p = c_p
	#+END_SRC
	

