W17/CS131.html

<div id="outline-container-org78d7f5c" class="outline-3">
<h3 id="org78d7f5c"><span class="section-number-3">4.4</span> Type</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Why we need type
<ul class="org-ul">
<li>Help us understand the code
when we look at an id x, we know which operations are valid and which are
not.</li>
<li><p>
Reliability/Redundancy
</p>
<div class="org-src-container">
<pre class="src src-c">string x;
x = x + 1; // ???
</pre>
</div>
<p>
Catch trivial mistakes early
</p></li>
<li>Performance
Type helps compiler generate better code</li>
</ul></li>

<li>Strongly Typed: All operations are type checked, you cannot escape
C/C++ is not strongly typed.</li>

<li>Primitive vs. Constructed types
<ul class="org-ul">
<li>Primitive types are built in while structure type are built by user.</li>
<li>array of C/C++ are constructed types</li>
</ul></li>

<li>What is type? Is it some data structure? How exposed is the implementation of
a type?
<ul class="org-ul">
<li>Exposed Type
User know details of the type: integral type</li>

<li><p>
Abstract Type
User only konw what operation can be done to that type
check NaN
</p>
<div class="org-src-container">
<pre class="src src-c">bool isnanf(float x)
{ return x!=x; }
bool isinfinityf()
{ return x!=0 &amp;&amp; x == 2*x; }
</pre>
</div>

<ul class="org-ul">
<li>floating point
<ul class="org-ul">
<li>Abstract type</li>
<li><p>
Why we need small number?
We need computation with small number
</p>
<div class="org-src-container">
<pre class="src src-c">if(x == y &amp;&amp; x-y==0) // does this always true????
</pre>
</div></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>

<div id="outline-container-org6a7ddcb" class="outline-4">
<h4 id="org6a7ddcb"><span class="section-number-4">4.4.1</span> Type equivalence: Structurally Equivalence and Name equivalence</h4>
<div class="outline-text-4" id="text-4-4-1">
<ul class="org-ul">
<li>C uses structural equivalence for typedef and name equivalence for struct
type.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd48bed" class="outline-4">
<h4 id="orgfd48bed"><span class="section-number-4">4.4.2</span> Subtype</h4>
<div class="outline-text-4" id="text-4-4-2">
<div class="org-src-container">
<pre class="src src-pascal">var a int,
var b 1..127,
</pre>
</div>
<ul class="org-ul">
<li>Subtype in C
<ul class="org-ul">
<li>float and double</li>
<li><p>
char* vs. char const* ???
</p>
<div class="org-src-container">
<pre class="src src-c">char *p;
char const* c_p;
c_p = p;
// p = c_p
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
</div>
