W17/CS131.tex

\subsection{Type}
\label{sec:org4aa901e}
\begin{itemize}
\item Why we need type
\begin{itemize}
\item Help us understand the code
when we look at an id x, we know which operations are valid and which are
not.
\item Reliability/Redundancy
\begin{verbatim}
string x;
x = x + 1; // ???
\end{verbatim}
Catch trivial mistakes early
\item Performance
Type helps compiler generate better code
\end{itemize}

\item Strongly Typed: All operations are type checked, you cannot escape
C/C++ is not strongly typed.

\item Primitive vs. Constructed types
\begin{itemize}
\item Primitive types are built in while structure type are built by user.
\item array of C/C++ are constructed types
\end{itemize}

\item What is type? Is it some data structure? How exposed is the implementation of
a type?
\begin{itemize}
\item Exposed Type
User know details of the type: integral type

\item Abstract Type
User only konw what operation can be done to that type
check NaN
\begin{verbatim}
bool isnanf(float x)
{ return x!=x; }
bool isinfinityf()
{ return x!=0 && x == 2*x; }
\end{verbatim}

\begin{itemize}
\item floating point
\begin{itemize}
\item Abstract type
\item Why we need small number?
We need computation with small number
\begin{verbatim}
if(x == y && x-y==0) // does this always true????
\end{verbatim}
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}

\subsubsection{Type equivalence: Structurally Equivalence and Name equivalence}
\label{sec:orgd86577b}
\begin{itemize}
\item C uses structural equivalence for typedef and name equivalence for struct
type.
\end{itemize}

\subsubsection{Subtype}
\label{sec:org5bcbfd8}
\begin{verbatim}
var a int,
var b 1..127,
\end{verbatim}
\begin{itemize}
\item Subtype in C
\begin{itemize}
\item float and double
\item char* vs. char const* ???
\begin{verbatim}
char *p;
char const* c_p;
c_p = p;
// p = c_p
\end{verbatim}
\end{itemize}
\end{itemize}
