W17/CS131.org
** Polymorphism
   - Early polymorphism: Type Coersion & overloading
     int vs. unsigned int
     #+BEGIN_SRC c
     int i = random();
     if( i < -217473848)
     {
        printf("machine error");
     }
     #+END_SRC

     long vs. double

     multiple bugs
     double f(double, int);
     double f(int, double);
     f(3,5);

     Error: Semantically ambiguous

   - Parametric polymorphism
     * iterator
       Suppose a list of string, we want to remove the short ones
       
       s = iterator.next
       s.length < xxx
       s.remove()

       This code has some problems because collections might contian any object
       so first assigning an object to string may cause trouble.

       If we know we are working with list of string, we can do runtime cast.
       s = (string) iterator

       However, some language has static type checking.
       Also, runtime type check has may harm performance. Python has the
       "runtime type checking" problem.

       In java, we use java template to solve this problem.

                             c is a collection of string Collection<string>
                             
       for(iterator<string> = c.begin(), ...)
          String s = c.next()

       No runtime type check.
       
       ML, Java: Generic
       C++: templates

       Template method is different from java/ml method. In template, we
       instantiate the template with the actual type. We know what the type is
       at compile time. It is similiar to macros. We actually compitle the code
       n times if we have n template. The machine code is copied n times also.

       That not how generic work. In Java, we just compile the generic version
       once. It is going to think is that going to work with any type. We just
       have one copy of the machine code. 

       Generic wins?

       "sizeof T" with T some template type. The compiler can convert it into a
       constant. However, in generic, this is still a variable. We do not know
       the size.

       Another example
       T x,y;
       x = y;

       In template, we know what instruction to execute because the type is know
       at compile time. However, in generic we do not know which instruction to
       take. 

       However, Java or ML use some other method to make this efficient. Every
       object is a pointer. We will never see the actual object. The above
       assignment is just poiner assignment. (Java does not have "sizeof"
       operator either). That's how generic work. We do not need to know the
       exact type of our object. We are just dealling with pointers(references).
       
     * Subtypes and generic
       Soppose a list of string:
       List<string> ls = [                  ];
       List<Obejct> lo = ls;
       lo.add new Thread;
       String s = ls.get() // we want the most recently added object
       
       The problem is that although string is a subtype of object, list of
       string is not a subtype of list of object.

       #+BEGIN_SRC java
         void printALL(Collection<?> c) {
           for(object o: c) {
             Object o = c.next();
             System.out.println(o);
           }
         }

	 // Soppose we String has a subtype of BlueString
	 printAll(Collection<BlueString> cbs); // Does this work?
	                                       // No because collection of bluesring is not a subtype of collection os string
         void printAll<Collection(? extends String> o);
	 // Only accept types that extends string
       #+END_SRC
       #+BEGIN_SRC java
         public static void <T> convert( T[], Collection<T> c) {
             for(int i=0; i<a.len ; i++)
             c.add(a[i]);
         }

         /**
          ,** Suppose: BlueString[] a, Collection<String> c will not work on convert
          ,** because convert require two parameter to be the same type.
          ,**/

         public static void <T> convert( T[], Collection<? super T> c) {
             for(int i=0; i<a.len ; i++)
             c.add(a[i]);
         }

       #+END_SRC	 
       
     * Python & Subtype
       - Duck Typing: 
	 Never ask whether a type is the subtype of another type. Just check if
         it works.

