W17/CS131.html


<div id="outline-container-orgf86a491" class="outline-3">
<h3 id="orgf86a491"><span class="section-number-3">4.5</span> Polymorphism</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li><p>
Early polymorphism: Type Coersion &amp; overloading
int vs. unsigned int
</p>
<div class="org-src-container">
<pre class="src src-c">int i = random();
if( i &lt; -217473848)
{
   printf("machine error");
}
</pre>
</div>

<p>
long vs. double
</p>

<p>
multiple bugs
double f(double, int);
double f(int, double);
f(3,5);
</p>

<p>
Error: Semantically ambiguous
</p></li>

<li>Parametric polymorphism
<ul class="org-ul">
<li><p>
iterator
Suppose a list of string, we want to remove the short ones
</p>

<p>
s = iterator.next
s.length &lt; xxx
s.remove()
</p>

<p>
This code has some problems because collections might contian any object
so first assigning an object to string may cause trouble.
</p>

<p>
If we know we are working with list of string, we can do runtime cast.
s = (string) iterator
</p>

<p>
However, some language has static type checking.
Also, runtime type check has may harm performance. Python has the
"runtime type checking" problem.
</p>

<p>
In java, we use java template to solve this problem.
</p>

<p>
c is a collection of string Collection&lt;string&gt;
</p>

<p>
for(iterator&lt;string&gt; = c.begin(), &#x2026;)
   String s = c.next()
</p>

<p>
No runtime type check.
</p>

<p>
ML, Java: Generic
C++: templates
</p>

<p>
Template method is different from java/ml method. In template, we
instantiate the template with the actual type. We know what the type is
at compile time. It is similiar to macros. We actually compitle the code
n times if we have n template. The machine code is copied n times also.
</p>

<p>
That not how generic work. In Java, we just compile the generic version
once. It is going to think is that going to work with any type. We just
have one copy of the machine code. 
</p>

<p>
Generic wins?
</p>

<p>
"sizeof T" with T some template type. The compiler can convert it into a
constant. However, in generic, this is still a variable. We do not know
the size.
</p>

<p>
Another example
T x,y;
x = y;
</p>

<p>
In template, we know what instruction to execute because the type is know
at compile time. However, in generic we do not know which instruction to
take. 
</p>

<p>
However, Java or ML use some other method to make this efficient. Every
object is a pointer. We will never see the actual object. The above
assignment is just poiner assignment. (Java does not have "sizeof"
operator either). That's how generic work. We do not need to know the
exact type of our object. We are just dealling with pointers(references).
</p></li>

<li><p>
Subtypes and generic
Soppose a list of string:
List&lt;string&gt; ls = [                  ];
List&lt;Obejct&gt; lo = ls;
lo.add new Thread;
String s = ls.get() // we want the most recently added object
</p>

<p>
The problem is that although string is a subtype of object, list of
string is not a subtype of list of object.
</p>

<div class="org-src-container">
<pre class="src src-java">void printALL(Collection&lt;?&gt; c) {
  for(object o: c) {
    Object o = c.next();
    System.out.println(o);
  }
}

// Soppose we String has a subtype of BlueString
printAll(Collection&lt;BlueString&gt; cbs); // Does this work?
				      // No because collection of bluesring is not a subtype of collection os string
void printAll&lt;Collection(? extends String&gt; o);
// Only accept types that extends string
</pre>
</div>
<div class="org-src-container">
<pre class="src src-java">public static void &lt;T&gt; convert( T[], Collection&lt;T&gt; c) {
    for(int i=0; i&lt;a.len ; i++)
    c.add(a[i]);
}

/**
 ** Suppose: BlueString[] a, Collection&lt;String&gt; c will not work on convert
 ** because convert require two parameter to be the same type.
 **/

public static void &lt;T&gt; convert( T[], Collection&lt;? super T&gt; c) {
    for(int i=0; i&lt;a.len ; i++)
    c.add(a[i]);
}
</pre>
</div></li>

<li>Python &amp; Subtype
<ul class="org-ul">
<li>Duck Typing: 
Never ask whether a type is the subtype of another type. Just check if
it works.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
