W17/CS131.org
** Java -- history
   - What we had
     workstations + servers + operation staff on a network = (Solaris written in
     C)
   - what they wanted: IoT
     * Reliability
     * size of program 
     * Flexibility(OOP)
     * architecture agnostic

   - First trial: C++
     C++ does provide flexibility but not other thing. For example, template
     increases program size.

   - Steal Smalltalk
     * OOP -> Flexibility
     * Bytecodes -> architecture agnostic
       Took program and translate it into machine independent bytecode. Then the
       interpreter will analyze the bytecode.
     * Runtime checking -> Reliability

   - Smalltalk bad ideas
     * Weird syntax
     * Program internally use secret bytecode
       For internet of thing, they need download bytecodes instead of machine
       code and let the hardware to intepret.
     
   - Oak ==> Java
     * 1995 Browser in Java
       HotJava and applets(java code compiled into bytecode)
     * And Browser Mosaic in C++
       which becomes IE and Mozilla
       Plugin technology which are dynamic linked machine code.
       To fix security issue, they later use javascript.
     * Java -> server worked well
            -> thread support
     

** Java Types
   - Primitive type
     byte, short, int, long, char, boolean, float, double
      8      16    32    64   16      1       32     64
                                           IEEE-754 fp

     In java, the those numbers are fixed for portable flexibility.
     In C, performance is more concerned. Machine are allowed to choose more
     suitable size.

     * Overflow??
       In C, overflow is undefined.
       In Java, overflow causes wrapping around ==> reliability.

   - References type
     Array.
     All objects are represented in pointers. You cannot see them but they're
     there.

     * Some thing valid in C++ but not in Java
       #+BEGIN_SRC c++
         int foo(int n) {
           char buf[512];

           return ...;
         }
       #+END_SRC

       Cannot allocate on the stack. Everything is on the heap.
       The size is dynamically chosen.
       Fixed after created.
       #+BEGIN_SRC java
         int foo(int n){
             char[] bof = new char[512];
             return xxx;
         }

         char[] foo(int n) {
             char[] bof = new char[512]; // Could be new char[n];
             return bof;
         }
       #+END_SRC 

** Java: Single Inheritance
   - Simple and elegant but not flexible
   - Use interfaces instead

* Week 5

** Abstract Class

