W17/CS131.html

<div id="outline-container-orgfc9daa9" class="outline-3">
<h3 id="orgfc9daa9"><span class="section-number-3">4.6</span> Java &#x2013; history</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>What we had
workstations + servers + operation staff on a network = (Solaris written in
C)</li>
<li>what they wanted: IoT
<ul class="org-ul">
<li>Reliability</li>
<li>size of program</li>
<li>Flexibility(OOP)</li>
<li>architecture agnostic</li>
</ul></li>

<li>First trial: C++
C++ does provide flexibility but not other thing. For example, template
increases program size.</li>

<li>Steal Smalltalk
<ul class="org-ul">
<li>OOP -&gt; Flexibility</li>
<li>Bytecodes -&gt; architecture agnostic
Took program and translate it into machine independent bytecode. Then the
interpreter will analyze the bytecode.</li>
<li>Runtime checking -&gt; Reliability</li>
</ul></li>

<li>Smalltalk bad ideas
<ul class="org-ul">
<li>Weird syntax</li>
<li>Program internally use secret bytecode
For internet of thing, they need download bytecodes instead of machine
code and let the hardware to intepret.</li>
</ul></li>

<li>Oak ==&gt; Java
<ul class="org-ul">
<li>1995 Browser in Java
HotJava and applets(java code compiled into bytecode)</li>
<li>And Browser Mosaic in C++
which becomes IE and Mozilla
Plugin technology which are dynamic linked machine code.
To fix security issue, they later use javascript.</li>
<li>Java -&gt; server worked well
-&gt; thread support</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgf2e178a" class="outline-3">
<h3 id="orgf2e178a"><span class="section-number-3">4.7</span> Java Types</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li><p>
Primitive type
byte, short, int, long, char, boolean, float, double
 8      16    32    64   16      1       32     64
				      IEEE-754 fp
</p>

<p>
In java, the those numbers are fixed for portable flexibility.
In C, performance is more concerned. Machine are allowed to choose more
suitable size.
</p>

<ul class="org-ul">
<li>Overflow??
In C, overflow is undefined.
In Java, overflow causes wrapping around ==&gt; reliability.</li>
</ul></li>

<li>References type
Array.
All objects are represented in pointers. You cannot see them but they're
there.

<ul class="org-ul">
<li><p>
Some thing valid in C++ but not in Java
</p>
<div class="org-src-container">
<pre class="src src-c++">int foo(int n) {
  char buf[512];

  return ...;
}
</pre>
</div>

<p>
Cannot allocate on the stack. Everything is on the heap.
The size is dynamically chosen.
Fixed after created.
</p>
<div class="org-src-container">
<pre class="src src-java">int foo(int n){
    char[] bof = new char[512];
    return xxx;
}

char[] foo(int n) {
    char[] bof = new char[512]; // Could be new char[n];
    return bof;
}
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org675c947" class="outline-3">
<h3 id="org675c947"><span class="section-number-3">4.8</span> Java: Single Inheritance</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li>Simple and elegant but not flexible</li>
<li>Use interfaces instead</li>
</ul>
</div>
</div>
</div>
