W17/CS131.tex

\subsection{Java -- history}
\label{sec:orgd925bc5}
\begin{itemize}
\item What we had
workstations + servers + operation staff on a network = (Solaris written in
C)
\item what they wanted: IoT
\begin{itemize}
\item Reliability
\item size of program
\item Flexibility(OOP)
\item architecture agnostic
\end{itemize}

\item First trial: C++
C++ does provide flexibility but not other thing. For example, template
increases program size.

\item Steal Smalltalk
\begin{itemize}
\item OOP -> Flexibility
\item Bytecodes -> architecture agnostic
Took program and translate it into machine independent bytecode. Then the
interpreter will analyze the bytecode.
\item Runtime checking -> Reliability
\end{itemize}

\item Smalltalk bad ideas
\begin{itemize}
\item Weird syntax
\item Program internally use secret bytecode
For internet of thing, they need download bytecodes instead of machine
code and let the hardware to intepret.
\end{itemize}

\item Oak ==> Java
\begin{itemize}
\item 1995 Browser in Java
HotJava and applets(java code compiled into bytecode)
\item And Browser Mosaic in C++
which becomes IE and Mozilla
Plugin technology which are dynamic linked machine code.
To fix security issue, they later use javascript.
\item Java -> server worked well
-> thread support
\end{itemize}
\end{itemize}


\subsection{Java Types}
\label{sec:org3bda141}
\begin{itemize}
\item Primitive type
byte, short, int, long, char, boolean, float, double
 8      16    32    64   16      1       32     64
				      IEEE-754 fp

In java, the those numbers are fixed for portable flexibility.
In C, performance is more concerned. Machine are allowed to choose more
suitable size.

\begin{itemize}
\item Overflow??
In C, overflow is undefined.
In Java, overflow causes wrapping around ==> reliability.
\end{itemize}

\item References type
Array.
All objects are represented in pointers. You cannot see them but they're
there.

\begin{itemize}
\item Some thing valid in C++ but not in Java
\begin{verbatim}
int foo(int n) {
  char buf[512];

  return ...;
}
\end{verbatim}

Cannot allocate on the stack. Everything is on the heap.
The size is dynamically chosen.
Fixed after created.
\begin{verbatim}
int foo(int n){
    char[] bof = new char[512];
    return xxx;
}

char[] foo(int n) {
    char[] bof = new char[512]; // Could be new char[n];
    return bof;
}
\end{verbatim}
\end{itemize}
\end{itemize}

\subsection{Java: Single Inheritance}
\label{sec:org0012460}
\begin{itemize}
\item Simple and elegant but not flexible
\item Use interfaces instead
\end{itemize}
