W17/CS131.org
*** Java Standard Library
1. Collection framwork
   Three interfaces
     (Copy)
     Serializable
     RandomAccess

   Collection of iterable which could be put into a for loop
     (Abstract collections) which implement collection
     List
       Abstract List
         Abstract Sequential list
	   LinkedList  ==> (implement) Queue CS
	   Array List CSR
	   vector (synchronized, thread-safe compared to array list) CSR
     Set 
       Sorted Set
       Abstract Set 
         Hash set (real class. can use the "new" keyword) CS
           LinkedHashSet
         TreSet CS

2. Object
   * Has constructor 
     so we can use "new" keyword for Object.
     Can be used as test case
     Placeholder

   * public boolean equal(Object arg);  == (reference equality)

   * public int hashCode();  default hashcode is some bits extracted from mem addr.
     For building hash table.
     We want the following to be true:
     If o1 == o2 then hashCode(o1) == hasCode(o2)
     Note that the reverse is not true.

   * public final Class<? extends Object> getClass(); 
     abstract (class) ==> subclass is mandatory
     final (class) ==> subclass is not allowed
     final (function) ==> cannot override it.
     Final allows inline and optimization ????

     Object o = ???
     Class c = o.getClass(); ==> May get "Thread"
     This is runtime type of o

     Reflection:
     Program tries to understand itself

     What is the point of getClass()?
     debug

     The "final" keyword does not allow overriding because you could write it in
     a way that it return a different class.

   * public String toString();
     For debug

   * protected void finalize(); can throw exception
     For garbage collector
     Why we need to override finalize method?
     A subclass overrides the finalize method to dispose of system resources or
     to perform other cleanup.

   * protected Object clone();
     
3. class Class
   * public final Class<? extends Object> getClass()
     

1. Thread
   Threads stay out of trouble via:
   * Synchronized
     int i;
     public synchronized int m() { i++; }
     this.lock() -> this.unlock()
   * Object.wait()
     1. remove all synchronized locks held by this thread
     2. Wait until the object beomes available

   * Object.notify()
     1. wakes up one thread 
