W17/CS131.html

<div id="outline-container-org51ac626" class="outline-2">
<h2 id="org51ac626"><span class="section-number-2">5</span> Week 5</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgf431575" class="outline-3">
<h3 id="orgf431575"><span class="section-number-3">5.1</span> Abstract Class</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-org277bce8" class="outline-4">
<h4 id="org277bce8"><span class="section-number-4">5.1.1</span> Java Standard Library</h4>
<div class="outline-text-4" id="text-5-1-1">
<ol class="org-ol">
<li><p>
Collection framwork
Three interfaces
  (Copy)
  Serializable
  RandomAccess
</p>

<p>
Collection of iterable which could be put into a for loop
  (Abstract collections) which implement collection
  List
    Abstract List
      Abstract Sequential list
	LinkedList  ==&gt; (implement) Queue CS
	Array List CSR
	vector (synchronized, thread-safe compared to array list) CSR
  Set 
    Sorted Set
    Abstract Set 
      Hash set (real class. can use the "new" keyword) CS
	LinkedHashSet
      TreSet CS
</p></li>

<li>Object
<ul class="org-ul">
<li>Has constructor 
so we can use "new" keyword for Object.
Can be used as test case
Placeholder</li>

<li>public boolean equal(Object arg);  == (reference equality)</li>

<li>public int hashCode();  default hashcode is some bits extracted from mem addr.
For building hash table.
We want the following to be true:
If o1 <code>= o2 then hashCode(o1) =</code> hasCode(o2)
Note that the reverse is not true.</li>

<li><p>
public final Class&lt;? extends Object&gt; getClass(); 
abstract (class) ==&gt; subclass is mandatory
final (class) ==&gt; subclass is not allowed
final (function) ==&gt; cannot override it.
Final allows inline and optimization ????
</p>

<p>
Object o = ???
Class c = o.getClass(); ==&gt; May get "Thread"
This is runtime type of o
</p>

<p>
Reflection:
Program tries to understand itself
</p>

<p>
What is the point of getClass()?
debug
</p>

<p>
The "final" keyword does not allow overriding because you could write it in
a way that it return a different class.
</p></li>

<li>public String toString();
For debug</li>

<li>protected void finalize(); can throw exception
For garbage collector
Why we need to override finalize method?
A subclass overrides the finalize method to dispose of system resources or
to perform other cleanup.</li>

<li>protected Object clone();</li>
</ul></li>

<li>class Class
<ul class="org-ul">
<li>public final Class&lt;? extends Object&gt; getClass()</li>
</ul></li>
</ol>


<ol class="org-ol">
<li>Thread
Threads stay out of trouble via:
<ul class="org-ul">
<li>Synchronized
int i;
public synchronized int m() { i++; }
this.lock() -&gt; this.unlock()</li>
<li>Object.wait()
<ol class="org-ol">
<li>remove all synchronized locks held by this thread</li>
<li>Wait until the object beomes available</li>
</ol></li>

<li>Object.notify()
<ol class="org-ol">
<li>wakes up one thread</li>
</ol></li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noel Song</p>
<p class="date">Created: 2017-02-08 Wed 23:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
