W17/CS131.tex

\section{Week 5}
\label{sec:orgba48538}

\subsection{Abstract Class}
\label{sec:org225327e}

\subsubsection{Java Standard Library}
\label{sec:orga4f52a6}
\begin{enumerate}
\item Collection framwork
Three interfaces
  (Copy)
  Serializable
  RandomAccess

Collection of iterable which could be put into a for loop
  (Abstract collections) which implement collection
  List
    Abstract List
      Abstract Sequential list
	LinkedList  ==> (implement) Queue CS
	Array List CSR
	vector (synchronized, thread-safe compared to array list) CSR
  Set 
    Sorted Set
    Abstract Set 
      Hash set (real class. can use the "new" keyword) CS
	LinkedHashSet
      TreSet CS

\item Object
\begin{itemize}
\item Has constructor 
so we can use "new" keyword for Object.
Can be used as test case
Placeholder

\item public boolean equal(Object arg);  == (reference equality)

\item public int hashCode();  default hashcode is some bits extracted from mem addr.
For building hash table.
We want the following to be true:
If o1 \texttt{= o2 then hashCode(o1) =} hasCode(o2)
Note that the reverse is not true.

\item public final Class<? extends Object> getClass(); 
abstract (class) ==> subclass is mandatory
final (class) ==> subclass is not allowed
final (function) ==> cannot override it.
Final allows inline and optimization ????

Object o = ???
Class c = o.getClass(); ==> May get "Thread"
This is runtime type of o

Reflection:
Program tries to understand itself

What is the point of getClass()?
debug

The "final" keyword does not allow overriding because you could write it in
a way that it return a different class.

\item public String toString();
For debug

\item protected void finalize(); can throw exception
For garbage collector
Why we need to override finalize method?
A subclass overrides the finalize method to dispose of system resources or
to perform other cleanup.

\item protected Object clone();
\end{itemize}

\item class Class
\begin{itemize}
\item public final Class<? extends Object> getClass()
\end{itemize}
\end{enumerate}


\begin{enumerate}
\item Thread
Threads stay out of trouble via:
\begin{itemize}
\item Synchronized
int i;
public synchronized int m() \{ i++; \}
this.lock() -> this.unlock()
\item Object.wait()
\begin{enumerate}
\item remove all synchronized locks held by this thread
\item Wait until the object beomes available
\end{enumerate}

\item Object.notify()
\begin{enumerate}
\item wakes up one thread
\end{enumerate}
\end{itemize}
\end{enumerate}
\end{document}
